_site/2013-10-02-comparison-leica-me-fujix100s-canon-40d.html


<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <title>Leica M-E, FUJIFILM X100S, Canon 40D 三款相机参数对比</title>
    
    <meta name="author" content="Kimi MA">

    <!-- Enable responsive viewport -->
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <!-- Le HTML5 shim, for IE6-8 support of HTML elements -->
    <!--[if lt IE 9]>
    <![endif]-->

    <!-- Le styles -->
    <link href="assets/themes/twitter/bootstrap/css/bootstrap.2.2.2.min.css" rel="stylesheet">
    <link href="assets/themes/twitter/css/style.css?body=1" rel="stylesheet" type="text/css" media="all">
    <link rel="shortcut icon" type="image/ico" href="/assets/favicon.ico">
    <!-- Le fav and touch icons -->
  <!-- Update these with your own images
    <link rel="shortcut icon" href="images/favicon.ico">
    <link rel="apple-touch-icon" href="images/apple-touch-icon.png">
    <link rel="apple-touch-icon" sizes="72x72" href="images/apple-touch-icon-72x72.png">
    <link rel="apple-touch-icon" sizes="114x114" href="images/apple-touch-icon-114x114.png">
  -->

    <!-- atom & rss feed -->
    <link href="/atom.xml" type="application/atom+xml" rel="alternate" title="Sitewide ATOM Feed">
    <link href="/rss.xml" type="application/rss+xml" rel="alternate" title="Sitewide RSS Feed">

  </head>

  <body>
    <div class="navbar navbar-fixed-top">
      <div class="navbar-inner">
        <div class="container-narrow">
          <a class="brand" href="/">Die Welt ist meine Vorstellung</a>
          <ul class="nav">
            
            
            


  
    
      
    
  
    
      
      	
      	<li><a href="/archive">Archive</a></li>
      	
      
    
  
    
      
    
  
    
      
      	
      	<li><a href="/categories">Topics</a></li>
      	
      
    
  
    
      
    
  
    
      
    
  
    
      
    
  
    
      
    
  
    
      
      	
      	<li><a href="/tags">Tags</a></li>
      	
      
    
  



          </ul>
        </div>
      </div>
    </div>

    <div class="container-narrow">

      <div class="content">
        

<div class="page-header">
  <h1>Leica M-E, FUJIFILM X100S, Canon 40D 三款相机参数对比 </h1>
</div>

<div class="row-fluid post-full">
  <div class="span12">
    <div class="date">
      <span>02 October 2013</span>
    </div>
    <div class="content">
      <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Comparison of the three cameras: Leica M-E, FUJIFILM X100s, Canon 40D</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Leica M-E</th>
<th scope="col" class="left">FUJIFILM X100S</th>
<th scope="col" class="left">Canon 40D</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Release date</td>
<td class="left">September 30, 2012</td>
<td class="left">January, 2013</td>
<td class="left">September 10, 2007</td>
</tr>

<tr>
<td class="left">Capture</td>
<td class="left">KAF -18500 18 MP CCD Sensor</td>
<td class="left">23.6mm x 15.8mm (APS-C) X-Trans CMOS II 連三原色濾鏡</td>
<td class="left">10.1MP CMOS</td>
</tr>

<tr>
<td class="left">Size WHD</td>
<td class="left">138 x 80 x 37mm</td>
<td class="left">126.5 (W) x 74.4 (H) x 53.9 (D) mm</td>
<td class="left">145.5 x 107.8 x 73.5mm</td>
</tr>

<tr>
<td class="left">Lens</td>
<td class="left">50mm f/2.0 SUMMICRON-M Lens</td>
<td class="left">f=23mm, 35mm, F2, 6 組 8 片鏡片</td>
<td class="left">Sigma 17-70mm f/2.8-4 DC MACRO OS HSM （C）</td>
</tr>

<tr>
<td class="left">Weight</td>
<td class="left">593g</td>
<td class="left">約445 g / 15.7 oz. (包括電池及記憶卡)</td>
<td class="left">740g</td>
</tr>

<tr>
<td class="left">Lens Weight</td>
<td class="left">240g</td>
<td class="left">N/A</td>
<td class="left">465g</td>
</tr>

<tr>
<td class="left">Total weight</td>
<td class="left">833g</td>
<td class="left">445g</td>
<td class="left">1205g</td>
</tr>

<tr>
<td class="left">Finder</td>
<td class="left">0.68x</td>
<td class="left">混合觀景器 0.5x</td>
<td class="left">0.95x</td>
</tr>

<tr>
<td class="left">Shutter</td>
<td class="left">Metal electronic</td>
<td class="left">mechanical shutter</td>
<td class="left">??</td>
</tr>

<tr>
<td class="left">Shutter 快門速度</td>
<td class="left">1/4,000 - 32s</td>
<td class="left">(P 模式) 1/4 秒 至 1/4000* 秒, (所有其它模式) 30 至 1/4000* 秒</td>
<td class="left">1/8,000 - 30s</td>
</tr>

<tr>
<td class="left">Flash Sync</td>
<td class="left">1/180</td>
<td class="left">&#xa0;</td>
<td class="left">1/250</td>
</tr>

<tr>
<td class="left">Price</td>
<td class="left">$5500 + $2200 lens = $7700</td>
<td class="left">$1300</td>
<td class="left">$1300 +  $500 lens = $1800</td>
</tr>

<tr>
<td class="left">Resolution</td>
<td class="left">18 MP 1800 萬像素</td>
<td class="left">16 MP 1630 萬像素</td>
<td class="left">10 MP 1000 萬像素</td>
</tr>

<tr>
<td class="left">Frame Rate</td>
<td class="left">2 FPS</td>
<td class="left">&#xa0;</td>
<td class="left">6.5FPS</td>
</tr>

<tr>
<td class="left">LCD</td>
<td class="left">2.5" 230k</td>
<td class="left">2.8 吋, 約 460,000 點</td>
<td class="left">3" LCD 230k</td>
</tr>

<tr>
<td class="left">ISO 感光度</td>
<td class="left">160 - 2500</td>
<td class="left">ISO 200 - 6400</td>
<td class="left">100 - 1600</td>
</tr>

<tr>
<td class="left">File Formats</td>
<td class="left">DNG, JPEG</td>
<td class="left">JPEG (Exif Ver 2.3)*2,RAW (RAF 格式), RAW+JPEG</td>
<td class="left">JPG, raw, s-raw (only 2.5MP) and JPG + raw</td>
</tr>

<tr>
<td class="left">Image Sizes</td>
<td class="left">5212 x 3472 (18 MP)</td>
<td class="left">L : (3:2) 4896 x 3264 / (16:9) 4896 x 2760 / (1:1) 3264 x 3264</td>
<td class="left">3,888 x 2,592 native</td>
</tr>

<tr>
<td class="left">Buffer Depth</td>
<td class="left">7</td>
<td class="left">8/9</td>
<td class="left">75 JPG or 17 raw??</td>
</tr>

<tr>
<td class="left">Shutter Life<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></td>
<td class="left">150,000 cycles</td>
<td class="left">N/A</td>
<td class="left">100,000 cycles</td>
</tr>

<tr>
<td class="left">Built-in Flash</td>
<td class="left">No</td>
<td class="left">自動閃光 (超級智能閃光燈)</td>
<td class="left">Yes, covers 17mm lens, GN 13m/43' at ISO 100</td>
</tr>

<tr>
<td class="left">Metering</td>
<td class="left">?</td>
<td class="left">TTL 256 區測光/點/多重/平均</td>
<td class="left">35 zone evaluative, center weighted, and spot.</td>
</tr>

<tr>
<td class="left">Power</td>
<td class="left">400 - 600 shots</td>
<td class="left">300 shots</td>
<td class="left">1,100 shots no flash and 800 with flash</td>
</tr>

<tr>
<td class="left">Focusing mechanism</td>
<td class="left">Rangefinder</td>
<td class="left">Reverse Galilean viewfinder with electronic bright frame display</td>
<td class="left">DSLR</td>
</tr>

<tr>
<td class="left">儲存媒體</td>
<td class="left">SD / SDHC Memory Cards</td>
<td class="left">SD 記憶卡 / SDHC 記憶卡/ SDXC (UHS-I) 記憶卡</td>
<td class="left">CF卡I or II</td>
</tr>

<tr>
<td class="left">光圏值</td>
<td class="left">F2 - F16</td>
<td class="left">F2 - F16 1/3EV 級</td>
<td class="left">F2.8-F4 ~ F22</td>
</tr>

<tr>
<td class="left">對焦範圍</td>
<td class="left">0.7m - 無限遠</td>
<td class="left">一般 約 50cm / 1.6 ft. - 無限遠, 微距 約 10cm - 2.0m / 3.9 in.- 6.6 ft.</td>
<td class="left">0.22m - 無限遠</td>
</tr>

<tr>
<td class="left">曝光控制</td>
<td class="left">&#xa0;</td>
<td class="left">TTL 256 區測光/點/多重/平均</td>
<td class="left">35区TTL全开光圈测光</td>
</tr>

<tr>
<td class="left">曝光補償</td>
<td class="left">-3 EV to +3 EV, 1/3 f-stops</td>
<td class="left">-2.0EV - +2.0EV 1/3EV 級</td>
<td class="left">-2.0EV - +2.0EV 1/3EV or 1/2EV 級</td>
</tr>

<tr>
<td class="left">視頻拍攝</td>
<td class="left">No</td>
<td class="left">1920 x 1080 像素 (60 fps / 30 fps) 立體聲</td>
<td class="left">No</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Review</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Leica M-E</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>pros
<ul class="org-ul">
<li>World best lens from Leica
</li>
<li>Good quality
</li>
<li>Rangefinder
</li>
<li>Excellent manual focus operation
</li>
<li>After all, it's Leica
</li>
</ul>
</li>
<li>cons
<ul class="org-ul">
<li>Very expensive
</li>
<li>Outdated LCD, only 230k
</li>
<li>No AF
</li>
<li>No video
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> FIJIFILM X100S</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>pros
<ul class="org-ul">
<li>Light for travel and daily photography, only half of weight of a leica with lens, and third of weight of a Canon 40D with lens.
</li>
<li>Fast AF system
</li>
<li>Good LCD resolution
</li>
<li>Wonderful Optical Electronic mix viewfinder
</li>
<li>With Video recording
</li>
<li>Good quality
</li>
<li>Good price, only 17% of a leica + 50mm F/2 lens
</li>
</ul>
</li>
<li>cons
<ul class="org-ul">
<li>Unchangeable lens
</li>
<li>Made in Japan
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="http://www.olegkikin.com/shutterlife/">http://www.olegkikin.com/shutterlife/</a>
</p></div>


</div>
</div>

    </div>

  
    <ul class="tag_box inline">
      <li><i class="icon-folder-open"></i></li>
      
      


  
     
    	<li><a href="/categories.html#photography-ref">
    		photography <span>1</span>
    	</a></li>
    
  


    </ul>
    

  
    <ul class="tag_box inline">
      <li><i class="icon-tags"></i></li>
      
      


  
     
    	<li><a href="/tags.html#camera-ref">camera <span>1</span></a></li>
    
  



    </ul>
    

    <hr>
    <div class="pagination">
      <ul>
      
        <li class="prev"><a href="/2013-09-27-export-org-file-to-other-folder" title="export .org to .html file in other folder">&larr; Previous</a></li>
      
        <li><a href="/archive.html">Archive</a></li>
      
        <li class="next"><a href="/2013-10-21-win7-black-screen-before-login" title="Window 7 黑屏无法登陆">Next &rarr;</a></li>
      
      </ul>
    </div>
    <hr>
    


  <!-- Duoshuo Comment BEGIN -->
	<div class="ds-thread"></div>
<script type="text/javascript">
var duoshuoQuery = {short_name:"kimim"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = 'http://static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		|| document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
<!-- Duoshuo Comment END -->





  </div>
</div>


      </div>
      <hr>
      <footer>
        <p>&copy; 2018 Kimi MA,
           All right reserved.
        </p>
      </footer>

    </div>

    
  </body>
</html>

